//*********************************************************
//File name	 : 0306.c
//Author  	 : 戴宇豪 
//Date   	 : 10.25
//Student ID : 2019216072
//*********************************************************
#include <stdio.h>
int main(void)
{
    float p ,d;
    int m ,n;
    printf("请输入机票价格、订票时间和订票数量：");
    scanf("%f %d %d",&p ,&m ,&n);
    if (m == 4 || m == 5 || m == 9 || m == 10)
    {
        if(n >= 20)
        {
           d = (1.0 - 0.2) * p * n;
        }
        else
        {
           d = (1.0 - 0.1) * p * n;
        }
    }
    else
    {
        if(n >= 20)
        {
            d = (1.0 - 0.4) * p * n;
        }
        else
        {
            d = (1.0 - 0.2) * p * n;
        }
    }
    printf("机票的总价格为：%f", d);
    return 0;
}
