//*********************************************************
//File name	 :  0308.c
//Author  	 : 戴宇豪
//Date   	 : 10.26
//Student ID : 2019216072 
//*********************************************************
#include <stdio.h>
int main()
{
    float a ,b ,c ,d ,e;
    printf("请输入雅思考试的听、说、读、写的单门成绩：");
    scanf("%f%f%f%f",&a,&b,&c,&d);
    e = (a + b + c + d) / 4.0f;
    if (e >= 6.0f && b >= 5.0f && c >= 5.0f && d >= 5.0f && a >= 5.0f)
    {
        printf("该雅思成绩合格");
    }
    else
    {
        printf("该雅思成绩不合格");
    }
    return 0;
}
