//*********************************************************
//File name	 : 0502.c
//Author  	 : 戴宇豪
//Date   	 : 11.06
//Student ID : 2019216072
//*********************************************************

#include <stdio.h>
int main(void)
{
    int a[10], A=0, B=0, C=0, D=0, E=0;
    int i; 
	for(i=0; i<10; i++)
    {
	    scanf("%d", &a[i]);
	    if(a[i]>=90 && a[i]<=100)
        {
            A++;
        }
        else if(a[i]>=80 && a[i]<=89)
        {
            B++;
        }
        else if(a[i]>=70 && a[i]<=79)
        {
            C++;
        }
        else if(a[i]>=60 && a[i]<=69)
        {
            D++;
        }
        else
        {
            E++;
        }
    }
    
    printf("成绩为优的有%d人，成绩为良的有%d人，成绩为中的有%d人，成绩为及格的有%d人，成绩为不及格的有%d人",A,B,C,D,E);
    return 0;
}
