//*********************************************************
//File name	 : 0515.c
//Author  	 : 戴宇豪
//Date   	 : 11.08
//Student ID : 2019216072
//*********************************************************

#include <stdio.h>
#include<stdlib.h>
int main()
{
    int a[5][5]={
	                {17,24,1,8,15},{23,5,7,14,16},{4,6,13,20,22},
	                {10,12,19,21,3},{11,18,25,2,9}
				};
    int h[5]={0}, l[5]={0}, sum1=0, sum2=0; 
	int i, j;
    for(i=0;i<5;i++)
    {
        for(j=0;j<5;j++)
        {
            h[i]+=a[i][j];
            l[i]+=a[j][i];
        }
        sum1+=a[i][i];
        sum2+=a[i][4-i];
    }
    if(sum1==h[0] && sum1==h[1] && sum1==h[2]
	   && sum1==h[3] && sum1==h[4] && sum1==l[0]
	   && sum1==l[1] && sum1==l[2] && sum1==l[3]
	   && sum1==l[4] && sum1==sum2)
    {
       printf("该矩阵是魔方阵");
    }
    else
    {
       printf("该矩阵不是魔方阵");
    }
    return 0;
}
