//*********************************************************
//File name	 : 0608.c
//Author  	 : 戴宇豪
//Date   	 : 11.15
//Student ID : 2019216072
//*********************************************************


#include<stdio.h>
int main()
{
	char a[5],b[20],*p,*q,ch;
	printf("请输入16进制字符串(有效十六进制不超过四位)：\n");
	gets(a);
	p=a;
	q=b+3;
	for(p=a,q=b+3;*p;p++,q+=4)
	{
	    if(*p>='0'&&*p<='9')
		{
			ch='0';
		}
		else if(*p>='A'&&*p<='F')
		{
			ch='A'-10;
		}
		else if(*p>='a'&&*p<='f')
		{
			ch='a'-10;
		}
		*q=(*p-ch)%2+'0';
	    *(q-1)=(*p-ch)/2%2+'0';
	    *(q-2)=(*p-ch)/2/2%2+'0';
	    *(q-3)=(*p-ch)/2/2/2%2+'0';

	}

	*(q-3)='\0';
	q=b;
  	puts(q);
    return 0;
 }
